%******************************
%       全局系统参数设置
%******************************
N  = 100;     % 跟踪时长
T  = 1;       % 采样时间间隔1s
Ps = 1;       % 目标存活概率
ZR = 2;       % 杂波期望
PD = 0.99999;     % 检测概率 
N_sensor = 14; % 传感器个数
R_DETECT = 1000;  % 观测范围设置
R_INTERVAL = 1000; % 平台之间的间距
R = diag([100,0.0001,0.0001]); % 观测误差协方差
Num_communicate_decen = 3;%单周期通信次数
Mnte_count = 1;%蒙特卡洛次数
%===========================
%     分散式拓扑矩阵生成
%===========================
location_center = [0;0;0;1]; % 平台原点坐标(前3维)，平台编号(第4维)
[mat_topo_decen,location] = topo_born_3d(N_sensor,location_center,R_INTERVAL,R_INTERVAL);
% 大都市权重分配
[mat_weight_decen] = Metropolis_Weights(mat_topo_decen);

% == 运动目标的状态属性设置 == 
% 1.初始X坐标  2.X速度  3.Y坐标  4.Y速度  5.Z坐标  6.Z速度  7.出现时间   8.消亡时间  9.运动模式
% 注: 最后一维的运动模式，有三种运动模式：CV,CA,CT  具体实现见函数 targetset.mat
motion_pattern_default = 1; % 默认运动模式
Set_TargetState=[
         400   -10   100    -10   0    0    20   N   ; % 1
        -1500   0   -500     10   0    0    1    80   ; % 2
        -1000   15   1700    0    0    0    1    N   ; % 3
        -1500   25   2300    10    0    0    50   N   ; % 4
        -800   -10   400     10   0    0    20   60  ; % 5
        -800    0    300    -10   0    0    1    N   ; % 6
         600   -15   1000   -10   0    0    20   N   ; % 7       
        -300    10  -500    -10   0    0    20   80  ; % 8
         1000    5    2000   -15   0    0    1    80   ; % 9
        -1400  -10   1500   -20   0    0    20    80  ; % 10
        -500    15   250     0    0    0    1    N   ; % 11
        ]';
